example_logs/prefix-4-128MB.load.txt
[OVERALL], RunTime(ms), 182390
[OVERALL], Throughput(ops/sec), 2537.9845386260213
[TOTAL_GCS_PS_Scavenge], Count, 351
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 934
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.512089478589835
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 351
[TOTAL_GC_TIME], Time(ms), 934
[TOTAL_GC_TIME_%], Time(%), 0.512089478589835
[CLEANUP], Operations, 4
[CLEANUP], AverageLatency(us), 59.0
[CLEANUP], MinLatency(us), 30
[CLEANUP], MaxLatency(us), 137
[CLEANUP], 0, 87.0
[CLEANUP], 1000, 32.0
[CLEANUP], 2000, 30.0
[INSERT], Operations, 462903
[INSERT], AverageLatency(us), 1555.01163310672
[INSERT], MinLatency(us), 13
[INSERT], MaxLatency(us), 180897052
[INSERT], Return=OK, 462903
[INSERT], 0, 224.57608809648661
[INSERT], 1000, 433.76603918555514
[INSERT], 2000, 348.2728694292416
[INSERT], 3000, 384.03126097646646
[INSERT], 4000, 384.00800674252
[INSERT], 5000, 432.20916334661354
[INSERT], 6000, 362.6059701492537
[INSERT], 7000, 419.52539479300043
[INSERT], 8000, 390.9953645174884
[INSERT], 9000, 399.7255655142979
[INSERT], 10000, 390.71955981540646
[INSERT], 11000, 400.3083645443196
[INSERT], 12000, 445.09954936501435
[INSERT], 13000, 350.73997793306364
[INSERT], 14000, 394.71672354948805
[INSERT], 15000, 387.71724622409556
[INSERT], 16000, 386.4473018549747
[INSERT], 17000, 385.54033290653007
[INSERT], 18000, 386.7892122072392
[INSERT], 19000, 389.1222081753055
[INSERT], 20000, 393.87965921192756
[INSERT], 21000, 397.14285714285717
[INSERT], 22000, 451.83013230900553
[INSERT], 23000, 386.8550358196376
[INSERT], 24000, 384.4531085353003
[INSERT], 25000, 382.77507469056764
[INSERT], 26000, 384.99227256761503
[INSERT], 27000, 388.39196197061364
[INSERT], 28000, 384.8714436248683
[INSERT], 29000, 405.2889667250438
[INSERT], 30000, 380.87444128403087
[INSERT], 31000, 385.2204571871368
[INSERT], 32000, 383.31416104720347
[INSERT], 33000, 382.440734557596
[INSERT], 34000, 382.3210272873194
[INSERT], 35000, 382.8406976744186
[INSERT], 36000, 391.65877157767966
[INSERT], 37000, 383.9036680251945
[INSERT], 38000, 382.81666666666666
[INSERT], 39000, 382.118378812199
[INSERT], 40000, 385.0256924929747
[INSERT], 41000, 420.5329457364341
[INSERT], 42000, 389.8150080256822
[INSERT], 43000, 385.5881172219992
[INSERT], 44000, 411.16165718927704
[INSERT], 45000, 376.23283218203983
[INSERT], 46000, 390.7426174496644
[INSERT], 47000, 378.12519260400614
[INSERT], 48000, 434.02516356316056
[INSERT], 49000, 396.1732653861231
[INSERT], 50000, 423.8343949044586
[INSERT], 51000, 338.0660410149461
[INSERT], 52000, 388.3774990199922
[INSERT], 53000, 387.9817532725109
[INSERT], 54000, 392.5776796467282
[INSERT], 55000, 394.4594276754214
[INSERT], 56000, 389.9861166203887
[INSERT], 57000, 382.8883982336411
[INSERT], 58000, 408.86149471974005
[INSERT], 59000, 368.6202328382176
[INSERT], 60000, 383.6112396694215
[INSERT], 61000, 386.2720706260032
[INSERT], 62000, 383.1372549019608
[INSERT], 63000, 403.3014676715589
[INSERT], 64000, 382.6512841091493
[INSERT], 65000, 382.09843137254904
[INSERT], 66000, 381.9367424242424
[INSERT], 67000, 385.1432950191571
[INSERT], 68000, 382.5590038314176
[INSERT], 69000, 384.22386363636366
[INSERT], 70000, 383.5681992337165
[INSERT], 71000, 394.8383141762452
[INSERT], 72000, 381.075028419856
[INSERT], 73000, 380.9068965517241
[INSERT], 74000, 382.3863636363636
[INSERT], 75000, 381.52758620689656
[INSERT], 76000, 381.91455938697317
[INSERT], 77000, 383.1708980674498
[INSERT], 78000, 381.38850574712643
[INSERT], 79000, 386.3903950426026
[INSERT], 80000, 376.7297815254887
[INSERT], 81000, 382.2698039215686
[INSERT], 82000, 381.6496789727127
[INSERT], 83000, 381.35303451011504
[INSERT], 84000, 384.60549019607845
[INSERT], 85000, 438.5577849117175
[INSERT], 86000, 382.05037683458943
[INSERT], 87000, 383.13639846743297
[INSERT], 88000, 383.3147330389402
[INSERT], 89000, 379.97069450020075
[INSERT], 90000, 405.6973544973545
[INSERT], 91000, 357.9566943341754
[INSERT], 92000, 381.7470895222802
[INSERT], 93000, 382.8397655105032
[INSERT], 94000, 452.6898039215686
[INSERT], 95000, 380.61779694237555
[INSERT], 96000, 382.1662038873463
[INSERT], 97000, 381.21487603305786
[INSERT], 98000, 382.27539140907265
[INSERT], 99000, 382.0760486083889
[INSERT], 100000, 380.46489488298295
[INSERT], 101000, 382.5327177840225
[INSERT], 102000, 384.82477459819677
[INSERT], 103000, 381.2499173553719
[INSERT], 104000, 390.8988496628322
[INSERT], 105000, 387.47271268057784
[INSERT], 106000, 404.2749019607843
[INSERT], 107000, 388.7001190003967
[INSERT], 108000, 382.08667736757627
[INSERT], 109000, 386.2183908045977
[INSERT], 110000, 380.98233641107987
[INSERT], 111000, 384.9635065450218
[INSERT], 112000, 385.1281850254802
[INSERT], 113000, 380.2898434363709
[INSERT], 114000, 381.5676033057851
[INSERT], 115000, 381.51844506148353
[INSERT], 116000, 383.0874166993336
[INSERT], 117000, 381.4423926134083
[INSERT], 118000, 383.53153510511703
[INSERT], 119000, 379.9514049586777
[INSERT], 120000, 390.17012936103487
[INSERT], 121000, 381.79727017262144
[INSERT], 122000, 380.9234430781436
[INSERT], 123000, 382.1905135241082
[INSERT], 124000, 391.95865114411885
[INSERT], 125000, 408.97421658072193
[INSERT], 126000, 407.2097216777734
[INSERT], 127000, 393.2782015254918
[INSERT], 128000, 381.07378024593413
[INSERT], 129000, 384.43237945903564
[INSERT], 130000, 384.07547169811323
[INSERT], 131000, 396.30105840846727
[INSERT], 132000, 396.56882189607296
[INSERT], 133000, 382.55238859895627
[INSERT], 134000, 384.9186776859504
[INSERT], 135000, 388.7710701685613
[INSERT], 136000, 390.6445854819516
[INSERT], 137000, 406.6193522590964
[INSERT], 138000, 389.93112947658403
[INSERT], 139000, 394.8207060690202
[INSERT], 140000, 455.75985663082434
[INSERT], 141000, 341.8120996441281
[INSERT], 142000, 395.44030146767153
[INSERT], 143000, 394.67855742845944
[INSERT], 144000, 395.62665596146127
[INSERT], 145000, 393.8658914728682
[INSERT], 146000, 386.7718541748334
[INSERT], 147000, 392.468085106383
[INSERT], 148000, 376.3371677905593
[INSERT], 149000, 395.14817718541747
[INSERT], 150000, 410.68847852268163
[INSERT], 151000, 392.25069416898054
[INSERT], 152000, 390.44805958447665
[INSERT], 153000, 399.05861099959856
[INSERT], 154000, 396.0286162289298
[INSERT], 155000, 388.06227687425627
[INSERT], 156000, 386.7033319951827
[INSERT], 157000, 383.50254802038415
[INSERT], 158000, 385.267750892503
[INSERT], 159000, 383.3129710432368
[INSERT], 160000, 384.5087603305785
[INSERT], 161000, 384.7334391114637
[INSERT], 162000, 384.67116223720745
[INSERT], 163000, 396.2852042840143
[INSERT], 164000, 396.2705275684252
[INSERT], 165000, 389.3050376834589
[INSERT], 166000, 436.53016003282727
[INSERT], 167000, 411.4520976831559
[INSERT], 168000, 515.4827449424831
[INSERT], 169000, 397.71717572391907
[INSERT], 170000, 401.9527965093217
[INSERT], 171000, 423.6388888888889
[INSERT], 172000, 415.230464101547
[INSERT], 173000, 402.5037683458945
[INSERT], 174000, 407.6739389131297
[INSERT], 175000, 399.22253074176916
[INSERT], 176000, 391.3252677508925
[INSERT], 177000, 396.81753272510906
[INSERT], 178000, 493.80327056491575
[INSERT], 179000, 1.79163809E8
[INSERT], 180000, 1.80220322E8
[INSERT], 181000, 1.80897052E8