example_logs/prefix-4-128MB.read_insert.txt
[OVERALL], RunTime(ms), 60005
[OVERALL], Throughput(ops/sec), 91.12573952170652
[TOTAL_GCS_PS_Scavenge], Count, 14
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 48
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0799933338888426
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 14
[TOTAL_GC_TIME], Time(ms), 48
[TOTAL_GC_TIME_%], Time(%), 0.0799933338888426
[READ], Operations, 2763
[READ], AverageLatency(us), 21421.310532030402
[READ], MinLatency(us), 14543
[READ], MaxLatency(us), 183885
[READ], Return=OK, 2763
[READ], 0, 23776.738095238095
[READ], 1000, 22967.232558139534
[READ], 2000, 22536.56818181818
[READ], 3000, 21659.782608695652
[READ], 4000, 21220.531914893618
[READ], 5000, 21864.155555555557
[READ], 6000, 22038.933333333334
[READ], 7000, 21215.82978723404
[READ], 8000, 21273.72340425532
[READ], 9000, 21035.531914893618
[READ], 10000, 21876.422222222223
[READ], 11000, 21333.787234042553
[READ], 12000, 22054.222222222223
[READ], 13000, 21415.55319148936
[READ], 14000, 22330.51111111111
[READ], 15000, 22086.244444444445
[READ], 16000, 22075.355555555554
[READ], 17000, 21614.369565217392
[READ], 18000, 21667.91304347826
[READ], 19000, 20967.395833333332
[READ], 20000, 21560.043478260868
[READ], 21000, 21412.531914893618
[READ], 22000, 21136.063829787236
[READ], 23000, 21108.617021276597
[READ], 24000, 21878.934782608696
[READ], 25000, 21765.304347826088
[READ], 26000, 20913.808510638297
[READ], 27000, 21749.5
[READ], 28000, 21613.043478260868
[READ], 29000, 21874.58695652174
[READ], 30000, 20035.2
[READ], 31000, 19510.980392156864
[READ], 32000, 20785.229166666668
[READ], 33000, 20748.958333333332
[READ], 34000, 20994.574468085106
[READ], 35000, 19598.019607843136
[READ], 36000, 21689.021739130436
[READ], 37000, 21627.565217391304
[READ], 38000, 22186.88888888889
[READ], 39000, 21056.978723404256
[READ], 40000, 25024.175
[READ], 41000, 21471.106382978724
[READ], 42000, 22331.659090909092
[READ], 43000, 21143.541666666668
[READ], 44000, 20997.255319148935
[READ], 45000, 20709.104166666668
[READ], 46000, 20889.8125
[READ], 47000, 20936.042553191488
[READ], 48000, 20719.775510204083
[READ], 49000, 21430.152173913044
[READ], 50000, 21152.520833333332
[READ], 51000, 21328.543478260868
[READ], 52000, 21080.895833333332
[READ], 53000, 20602.666666666668
[READ], 54000, 21994.37777777778
[READ], 55000, 21249.978723404256
[READ], 56000, 21272.340425531915
[READ], 57000, 20515.591836734693
[READ], 58000, 20804.958333333332
[READ], 59000, 21131.055555555555
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 125.0
[CLEANUP], MinLatency(us), 125
[CLEANUP], MaxLatency(us), 125
[CLEANUP], 0, 125.0
[INSERT], Operations, 2705
[INSERT], AverageLatency(us), 52.09279112754159
[INSERT], MinLatency(us), 14
[INSERT], MaxLatency(us), 7503
[INSERT], Return=OK, 2705
[INSERT], 0, 537.8
[INSERT], 1000, 255.75675675675674
[INSERT], 2000, 61.53658536585366
[INSERT], 3000, 63.80555555555556
[INSERT], 4000, 48.81818181818182
[INSERT], 5000, 234.14634146341464
[INSERT], 6000, 42.81818181818182
[INSERT], 7000, 36.32203389830509
[INSERT], 8000, 35.129629629629626
[INSERT], 9000, 129.53191489361703
[INSERT], 10000, 27.10909090909091
[INSERT], 11000, 28.72222222222222
[INSERT], 12000, 25.67241379310345
[INSERT], 13000, 129.66666666666666
[INSERT], 14000, 28.258064516129032
[INSERT], 15000, 30.36842105263158
[INSERT], 16000, 27.477272727272727
[INSERT], 17000, 29.833333333333332
[INSERT], 18000, 26.11627906976744
[INSERT], 19000, 29.523809523809526
[INSERT], 20000, 27.46511627906977
[INSERT], 21000, 28.65
[INSERT], 22000, 31.38235294117647
[INSERT], 23000, 29.405405405405407
[INSERT], 24000, 27.224489795918366
[INSERT], 25000, 25.939393939393938
[INSERT], 26000, 26.56
[INSERT], 27000, 125.77777777777777
[INSERT], 28000, 25.967741935483872
[INSERT], 29000, 25.316666666666666
[INSERT], 30000, 27.264150943396228
[INSERT], 31000, 53.839285714285715
[INSERT], 32000, 25.442622950819672
[INSERT], 33000, 25.14814814814815
[INSERT], 34000, 28.0
[INSERT], 35000, 49.26984126984127
[INSERT], 36000, 26.952380952380953
[INSERT], 37000, 26.933333333333334
[INSERT], 38000, 25.5
[INSERT], 39000, 74.44444444444444
[INSERT], 40000, 29.26923076923077
[INSERT], 41000, 27.96
[INSERT], 42000, 22.24390243902439
[INSERT], 43000, 59.60377358490566
[INSERT], 44000, 23.475
[INSERT], 45000, 22.446428571428573
[INSERT], 46000, 24.367346938775512
[INSERT], 47000, 72.26190476190476
[INSERT], 48000, 25.375
[INSERT], 49000, 24.28205128205128
[INSERT], 50000, 21.866666666666667
[INSERT], 51000, 53.76190476190476
[INSERT], 52000, 22.673076923076923
[INSERT], 53000, 23.6
[INSERT], 54000, 26.15625
[INSERT], 55000, 23.53846153846154
[INSERT], 56000, 79.32558139534883
[INSERT], 57000, 22.09090909090909
[INSERT], 58000, 21.0
[INSERT], 59000, 23.307692307692307